tests/reports/latest/single/load.txt
tests  (git)-[main]- ➤ pnpm test:load:local

> tests@1.0.0 test:load:local /Users/subhajitgorai/Codes/current_projects/opencanvas/tests
> artillery run load-test.yml -e local

Test run id: tf88d_e3eza3ne8a8qyd3a7nayaj599txwe_jwgb
Phase started: Warm up - filling cache (index: 0, duration: 30s) 10:24:19(+0530)

--------------------------------------
Metrics for period to: 10:24:30(+0530) (width: 9.81s)
--------------------------------------

http.codes.200: ................................................................ 100
http.downloaded_bytes: ......................................................... 1252197
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 100
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 18
  mean: ........................................................................ 1.3
  median: ...................................................................... 1
  p95: ......................................................................... 4
  p99: ......................................................................... 12.1
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 18
  mean: ........................................................................ 1.3
  median: ...................................................................... 1
  p95: ......................................................................... 4
  p99: ......................................................................... 12.1
http.responses: ................................................................ 100
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.Custom limits (Cache Miss / DB Stress): ................. 29
vusers.created_by_name.Main feed (Cache Hit heavy): ............................ 71
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.2
  max: ......................................................................... 42.9
  mean: ........................................................................ 5.1
  median: ...................................................................... 3.4
  p95: ......................................................................... 13.6
  p99: ......................................................................... 31.5


--------------------------------------
Metrics for period to: 10:24:40(+0530) (width: 9.811s)
--------------------------------------

http.codes.200: ................................................................ 100
http.downloaded_bytes: ......................................................... 1189136
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 100
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 2
  mean: ........................................................................ 0.7
  median: ...................................................................... 1
  p95: ......................................................................... 1
  p99: ......................................................................... 1
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 2
  mean: ........................................................................ 0.7
  median: ...................................................................... 1
  p95: ......................................................................... 1
  p99: ......................................................................... 1
http.responses: ................................................................ 100
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.Custom limits (Cache Miss / DB Stress): ................. 23
vusers.created_by_name.Main feed (Cache Hit heavy): ............................ 77
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.9
  max: ......................................................................... 3.8
  mean: ........................................................................ 2.6
  median: ...................................................................... 2.5
  p95: ......................................................................... 3.4
  p99: ......................................................................... 3.6


Phase completed: Warm up - filling cache (index: 0, duration: 30s) 10:24:49(+0530)

Phase started: Ramp up - scaling connections (index: 1, duration: 60s) 10:24:49(+0530)

--------------------------------------
Metrics for period to: 10:24:50(+0530) (width: 9.81s)
--------------------------------------

http.codes.200: ................................................................ 100
http.downloaded_bytes: ......................................................... 1278498
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 100
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 1
  mean: ........................................................................ 0.7
  median: ...................................................................... 1
  p95: ......................................................................... 1
  p99: ......................................................................... 1
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 1
  mean: ........................................................................ 0.7
  median: ...................................................................... 1
  p95: ......................................................................... 1
  p99: ......................................................................... 1
http.responses: ................................................................ 100
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.Custom limits (Cache Miss / DB Stress): ................. 33
vusers.created_by_name.Main feed (Cache Hit heavy): ............................ 67
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.8
  max: ......................................................................... 4.2
  mean: ........................................................................ 2.6
  median: ...................................................................... 2.5
  p95: ......................................................................... 3.6
  p99: ......................................................................... 4


--------------------------------------
Metrics for period to: 10:25:00(+0530) (width: 9.865s)
--------------------------------------

http.codes.200: ................................................................ 173
http.downloaded_bytes: ......................................................... 2115415
http.request_rate: ............................................................. 19/sec
http.requests: ................................................................. 173
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 6
  mean: ........................................................................ 1.6
  median: ...................................................................... 1
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 6
  mean: ........................................................................ 1.6
  median: ...................................................................... 1
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.responses: ................................................................ 173
vusers.completed: .............................................................. 173
vusers.created: ................................................................ 173
vusers.created_by_name.Custom limits (Cache Miss / DB Stress): ................. 48
vusers.created_by_name.Main feed (Cache Hit heavy): ............................ 125
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.1
  max: ......................................................................... 35.3
  mean: ........................................................................ 5.4
  median: ...................................................................... 4.8
  p95: ......................................................................... 7.9
  p99: ......................................................................... 12.1


--------------------------------------
Metrics for period to: 10:25:10(+0530) (width: 9.982s)
--------------------------------------

http.codes.200: ................................................................ 324
http.downloaded_bytes: ......................................................... 4278750
http.request_rate: ............................................................. 33/sec
http.requests: ................................................................. 324
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 4
  mean: ........................................................................ 1.2
  median: ...................................................................... 1
  p95: ......................................................................... 2
  p99: ......................................................................... 3
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 4
  mean: ........................................................................ 1.2
  median: ...................................................................... 1
  p95: ......................................................................... 2
  p99: ......................................................................... 3
http.responses: ................................................................ 324
vusers.completed: .............................................................. 324
vusers.created: ................................................................ 324
vusers.created_by_name.Custom limits (Cache Miss / DB Stress): ................. 109
vusers.created_by_name.Main feed (Cache Hit heavy): ............................ 215
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.6
  max: ......................................................................... 8.3
  mean: ........................................................................ 4.2
  median: ...................................................................... 3.9
  p95: ......................................................................... 6.4
  p99: ......................................................................... 6.9


--------------------------------------
Metrics for period to: 10:25:20(+0530) (width: 9.965s)
--------------------------------------

http.codes.200: ................................................................ 478
http.downloaded_bytes: ......................................................... 5925498
http.request_rate: ............................................................. 48/sec
http.requests: ................................................................. 478
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 6
  mean: ........................................................................ 1
  median: ...................................................................... 1
  p95: ......................................................................... 2
  p99: ......................................................................... 2
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 6
  mean: ........................................................................ 1
  median: ...................................................................... 1
  p95: ......................................................................... 2
  p99: ......................................................................... 2
http.responses: ................................................................ 478
vusers.completed: .............................................................. 478
vusers.created: ................................................................ 478
vusers.created_by_name.Custom limits (Cache Miss / DB Stress): ................. 141
vusers.created_by_name.Main feed (Cache Hit heavy): ............................ 337
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.6
  max: ......................................................................... 9.8
  mean: ........................................................................ 3.5
  median: ...................................................................... 3.4
  p95: ......................................................................... 5.3
  p99: ......................................................................... 6.1


--------------------------------------
Metrics for period to: 10:25:30(+0530) (width: 9.955s)
--------------------------------------

http.codes.200: ................................................................ 628
http.downloaded_bytes: ......................................................... 7502205
http.request_rate: ............................................................. 64/sec
http.requests: ................................................................. 628
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 6
  mean: ........................................................................ 0.9
  median: ...................................................................... 1
  p95: ......................................................................... 2
  p99: ......................................................................... 3
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 6
  mean: ........................................................................ 0.9
  median: ...................................................................... 1
  p95: ......................................................................... 2
  p99: ......................................................................... 3
http.responses: ................................................................ 628
vusers.completed: .............................................................. 628
vusers.created: ................................................................ 628
vusers.created_by_name.Custom limits (Cache Miss / DB Stress): ................. 176
vusers.created_by_name.Main feed (Cache Hit heavy): ............................ 452
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.7
  max: ......................................................................... 8.9
  mean: ........................................................................ 3.1
  median: ...................................................................... 3.1
  p95: ......................................................................... 4.2
  p99: ......................................................................... 6


--------------------------------------
Metrics for period to: 10:25:40(+0530) (width: 9.973s)
--------------------------------------

http.codes.200: ................................................................ 784
http.downloaded_bytes: ......................................................... 9735872
http.request_rate: ............................................................. 79/sec
http.requests: ................................................................. 784
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 5
  mean: ........................................................................ 0.8
  median: ...................................................................... 1
  p95: ......................................................................... 1
  p99: ......................................................................... 2
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 5
  mean: ........................................................................ 0.8
  median: ...................................................................... 1
  p95: ......................................................................... 1
  p99: ......................................................................... 2
http.responses: ................................................................ 784
vusers.completed: .............................................................. 784
vusers.created: ................................................................ 784
vusers.created_by_name.Custom limits (Cache Miss / DB Stress): ................. 234
vusers.created_by_name.Main feed (Cache Hit heavy): ............................ 550
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.4
  max: ......................................................................... 9.1
  mean: ........................................................................ 2.9
  median: ...................................................................... 2.9
  p95: ......................................................................... 3.9
  p99: ......................................................................... 5.2


Phase completed: Ramp up - scaling connections (index: 1, duration: 60s) 10:25:49(+0530)

Phase started: Sudden spike - the viral event (index: 2, duration: 10s) 10:25:49(+0530)

--------------------------------------
Metrics for period to: 10:25:50(+0530) (width: 9.992s)
--------------------------------------

http.codes.200: ................................................................ 1023
http.downloaded_bytes: ......................................................... 12631642
http.request_rate: ............................................................. 103/sec
http.requests: ................................................................. 1024
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 2
  mean: ........................................................................ 0.7
  median: ...................................................................... 1
  p95: ......................................................................... 1
  p99: ......................................................................... 2
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 2
  mean: ........................................................................ 0.7
  median: ...................................................................... 1
  p95: ......................................................................... 1
  p99: ......................................................................... 2
http.responses: ................................................................ 1023
vusers.completed: .............................................................. 1023
vusers.created: ................................................................ 1024
vusers.created_by_name.Custom limits (Cache Miss / DB Stress): ................. 296
vusers.created_by_name.Main feed (Cache Hit heavy): ............................ 728
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.1
  max: ......................................................................... 5.9
  mean: ........................................................................ 2.4
  median: ...................................................................... 2.4
  p95: ......................................................................... 3.4
  p99: ......................................................................... 4.1


Phase completed: Sudden spike - the viral event (index: 2, duration: 10s) 10:25:59(+0530)

--------------------------------------
Metrics for period to: 10:26:00(+0530) (width: 9.93s)
--------------------------------------

http.codes.200: ................................................................ 4890
http.downloaded_bytes: ......................................................... 61201311
http.request_rate: ............................................................. 500/sec
http.requests: ................................................................. 4889
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 5
  mean: ........................................................................ 0.4
  median: ...................................................................... 0
  p95: ......................................................................... 1
  p99: ......................................................................... 1
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 5
  mean: ........................................................................ 0.4
  median: ...................................................................... 0
  p95: ......................................................................... 1
  p99: ......................................................................... 1
http.responses: ................................................................ 4890
vusers.completed: .............................................................. 4890
vusers.created: ................................................................ 4889
vusers.created_by_name.Custom limits (Cache Miss / DB Stress): ................. 1454
vusers.created_by_name.Main feed (Cache Hit heavy): ............................ 3435
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1
  max: ......................................................................... 6.1
  mean: ........................................................................ 1.4
  median: ...................................................................... 1.3
  p95: ......................................................................... 2.1
  p99: ......................................................................... 2.9


All VUs finished. Total time: 1 minute, 42 seconds

--------------------------------
Summary report @ 10:26:02(+0530)
--------------------------------

http.codes.200: ................................................................ 8600
http.downloaded_bytes: ......................................................... 107110524
http.request_rate: ............................................................. 87/sec
http.requests: ................................................................. 8600
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 18
  mean: ........................................................................ 0.6
  median: ...................................................................... 1
  p95: ......................................................................... 1
  p99: ......................................................................... 2
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 18
  mean: ........................................................................ 0.6
  median: ...................................................................... 1
  p95: ......................................................................... 1
  p99: ......................................................................... 2
http.responses: ................................................................ 8600
vusers.completed: .............................................................. 8600
vusers.created: ................................................................ 8600
vusers.created_by_name.Custom limits (Cache Miss / DB Stress): ................. 2543
vusers.created_by_name.Main feed (Cache Hit heavy): ............................ 6057
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1
  max: ......................................................................... 42.9
  mean: ........................................................................ 2.2
  median: ...................................................................... 1.7
  p95: ......................................................................... 4.3
  p99: ......................................................................... 6.2